---
kind: method
id: M:Autodesk.Revit.DB.ScheduleDefinition.IsValidCategoryForFilterBySheet
source: html/150856e4-938c-b7a6-9c27-5c46d60898b2.htm
---
# Autodesk.Revit.DB.ScheduleDefinition.IsValidCategoryForFilterBySheet Method

Checks whether a schedule can be filtered by sheet.

## Syntax (C#)
```csharp
public bool IsValidCategoryForFilterBySheet()
```

## Returns
True if the schedule can be filtered by sheet,
 false otherwise.